Explain dimension reduction in machine learning?

Dimension reduction is the transformation of data from a high-dimensional space into 
a low-dimensional space so that the low-dimensional representation retains some meaningful
properties of the original data, ideally close to its intrinsic dimension.
                               or
Dimensionality reduction refers to techniques that reduce the number of input variables in a dataset

How can you handle duplicate values in a dataset for a variable in Python using pandas?
Suppose, you are given the following dataset:
df = pd.read_csv('file.csv')
This dataset has many duplicate values. You need to identify them and also remove them.

In [1]:
# Importing library
import pandas as pd

In [2]:
# Creating the raw data
raw_data={
    "city":['Bangalore','Mysore','Bangalore','Kalaburagi','Kalaburagi','Bangalore','Kalaburagi','Mysore','Mysore'],
    "rank":["1st","2nd","1st","2nd","1st","2nd","1st","2nd","1st"],
    "score1":[44,48,39,41,38,44,34,54,61],
    "score2":[67,63,55,70,64,77,45,66,72],
}
df=pd.DataFrame(raw_data,columns=['city','rank','score1','score2'])
df

         city rank  score1  score2
0   Bangalore  1st      44      67
1      Mysore  2nd      48      63
2   Bangalore  1st      39      55
3  Kalaburagi  2nd      41      70
4  Kalaburagi  1st      38      64
5   Bangalore  2nd      44      77
6  Kalaburagi  1st      34      45
7      Mysore  2nd      54      66
8      Mysore  1st      61      72

In [4]:
# Creating the csv file
df.to_csv("file.csv",index=False)

In [5]:
# reading the csv file
df = pd.read_csv('file.csv')

In [6]:
df.head()

         city rank  score1  score2
0   Bangalore  1st      44      67
1      Mysore  2nd      48      63
2   Bangalore  1st      39      55
3  Kalaburagi  2nd      41      70
4  Kalaburagi  1st      38      64

In [7]:
# lets check the duplicate values , True means duplicate value exists
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [8]:
#lets check duplicate values for city column
df.duplicated(['city'])

0    False
1    False
2     True
3    False
4     True
5     True
6     True
7     True
8     True
dtype: bool

In [9]:
# lets check for city and rank
df.duplicated(['city','rank'])

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
8    False
dtype: bool

In [10]:
# Removing the duplicate values from the city and rank column
df.drop_duplicates(['city','rank'],inplace=True)

In [11]:
df

         city rank  score1  score2
0   Bangalore  1st      44      67
1      Mysore  2nd      48      63
3  Kalaburagi  2nd      41      70
4  Kalaburagi  1st      38      64
5   Bangalore  2nd      44      77
8      Mysore  1st      61      72